In [1]:
import pandas as pd
import numpy as np
import tensorflow as tf
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('train.csv')
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Gender                      550068 non-null  object
 3   Age                         550068 non-null  object
 4   Occupation                  550068 non-null  int64
 5   City_Category               550068 non-null  object
 6   Stay_In_Current_City_Years  550068 non-null  object
 7   Marital_Status              550068 non-null  int64
 8   Product_Category_1          550068 non-null  int64
 9   Product_Category_2          376430 non-null  float64
 10  Product_Category_3          166821 non-null  float64
 11  Purchase                    550068 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 50.4+ MB

In [4]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
dtype: int64

In [5]:
df.groupby('Gender').sum()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
Gender,,,,,,,
F,136234060927,915426,56988,776517,916139.0,468179.0,1186232642
M,415500008355,3527312,168349,2196199,2788809.0,1645150.0,3909580100

In [6]:
append = pd.get_dummies(df['Gender'], drop_first=True)
df =  pd.concat([df.drop('Gender',axis=1),append], axis=1)

In [7]:
df.head()
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [8]:
appendcity = pd.get_dummies(df['City_Category'],drop_first=True)
df = pd.concat([df.drop('City_Category', axis=1),appendcity],axis=1)`

In [9]:
df.head()

,User_ID,Product_ID,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,M,B,C
0,1000001,P00069042,0-17,10,2,0,3,NaN,NaN,8370,0,0,0
1,1000001,P00248942,0-17,10,2,0,1,6.0,14.0,15200,0,0,0
2,1000001,P00087842,0-17,10,2,0,12,NaN,NaN,1422,0,0,0
3,1000001,P00085442,0-17,10,2,0,12,14.0,NaN,1057,0,0,0
4,1000002,P00285442,55+,16,4+,0,8,NaN,NaN,7969,1,0,1

In [10]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [11]:
appendcity = pd.get_dummies(df['Age'],drop_first=True)
df = pd.concat([df.drop('Age', axis=1),appendcity],axis=1)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 18 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   Occupation                  550068 non-null  int64
 3   Stay_In_Current_City_Years  550068 non-null  object
 4   Marital_Status              550068 non-null  int64
 5   Product_Category_1          550068 non-null  int64
 6   Product_Category_2          376430 non-null  float64
 7   Product_Category_3          166821 non-null  float64
 8   Purchase                    550068 non-null  int64
 9   M                           550068 non-null  uint8
 10  B                           550068 non-null  uint8
 11  C                           550068 non-null  uint8
 12  18-25                       550068 non-null  uint8
 13  26-35                       550068 non-null  uint8
 14  36-45                       550068 non-null  uint8
 15  46-50                       550068 non-null  uint8
 16  51-55                       550068 non-null  uint8
 17  55+                         550068 non-null  uint8
dtypes: float64(2), int64(5), object(2), uint8(9)
memory usage: 42.5+ MB

In [13]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [14]:
def update(x):
    if x=='4+':
        return int(4)
    else:
        return int(x)

In [15]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].apply(lambda x: update(x))

In [16]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Occupation                         0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            173638
Product_Category_3            383247
Purchase                           0
M                                  0
B                                  0
C                                  0
18-25                              0
26-35                              0
36-45                              0
46-50                              0
51-55                              0
55+                                0
dtype: int64

In [17]:
df["Product_Category_2"].fillna(0, inplace = True)
df["Product_Category_3"].fillna(0, inplace = True)

In [18]:
df.isnull().sum()

User_ID                       0
Product_ID                    0
Occupation                    0
Stay_In_Current_City_Years    0
Marital_Status                0
Product_Category_1            0
Product_Category_2            0
Product_Category_3            0
Purchase                      0
M                             0
B                             0
C                             0
18-25                         0
26-35                         0
36-45                         0
46-50                         0
51-55                         0
55+                           0
dtype: int64

In [19]:
df.columns

Index(['User_ID', 'Product_ID', 'Occupation', 'Stay_In_Current_City_Years',
       'Marital_Status', 'Product_Category_1', 'Product_Category_2',
       'Product_Category_3', 'Purchase', 'M', 'B', 'C', '18-25', '26-35',
       '36-45', '46-50', '51-55', '55+'],
      dtype='object')

In [20]:
final = df[['Occupation', 'Stay_In_Current_City_Years',
       'Marital_Status', 'Product_Category_1', 'Product_Category_2',
       'Product_Category_3', 'M', 'B', 'C', '18-25', '26-35',
       '36-45', '46-50', '51-55', '55+']]

In [21]:
Y = df['Purchase'].values

In [22]:
X = final.iloc[:,:].values

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size = 0.25,random_state=0)

In [24]:
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Lasso
from sklearn.linear_model import ElasticNet
from sklearn.tree import DecisionTreeRegressor
from sklearn.neighbors import KNeighborsRegressor
from sklearn.ensemble import GradientBoostingRegressor
from sklearn.svm import SVR

In [25]:
DT = DecisionTreeRegressor()
DT.fit(X_train, y_train)
y_pred = DT.predict(X_test)
y_pred[y_pred<0] = 0
from sklearn import metrics
print('RMSE:', 100*np.sqrt(metrics.mean_squared_error(y_test, y_pred)))

RMSE: 333632.47555105074

In [26]:
df_test = pd.read_csv('test.csv')

In [27]:
append = pd.get_dummies(df_test['Gender'], drop_first=True)
df_test =  pd.concat([df_test.drop('Gender',axis=1),append], axis=1)

appendcity = pd.get_dummies(df_test['City_Category'],drop_first=True)
df_test = pd.concat([df_test.drop('City_Category', axis=1),appendcity],axis=1)

appendcity = pd.get_dummies(df_test['Age'],drop_first=True)
df_test = pd.concat([df_test.drop('Age', axis=1),appendcity],axis=1)

df_test['Stay_In_Current_City_Years']=df_test['Stay_In_Current_City_Years'].apply(lambda x: update(x))

df_test["Product_Category_2"].fillna(0, inplace = True)
df_test["Product_Category_3"].fillna(0, inplace = True)

test_data = df_test[['Occupation', 'Stay_In_Current_City_Years',
       'Marital_Status', 'Product_Category_1', 'Product_Category_2',
       'Product_Category_3', 'M', 'B', 'C', '18-25', '26-35',
       '36-45', '46-50', '51-55', '55+']]

X_set = test_data.iloc[:,:].values

In [28]:
df.head()

,User_ID,Product_ID,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,M,B,C,18-25,26-35,36-45,46-50,51-55,55+
0,1000001,P00069042,10,2,0,3,0.0,0.0,8370,0,0,0,0,0,0,0,0,0
1,1000001,P00248942,10,2,0,1,6.0,14.0,15200,0,0,0,0,0,0,0,0,0
2,1000001,P00087842,10,2,0,12,0.0,0.0,1422,0,0,0,0,0,0,0,0,0
3,1000001,P00085442,10,2,0,12,14.0,0.0,1057,0,0,0,0,0,0,0,0,0
4,1000002,P00285442,16,4,0,8,0.0,0.0,7969,1,0,1,0,0,0,0,0,1

In [29]:
pred = DT.predict(X_set)
pred[pred<0] = 0
submit = pd.DataFrame({
    'Purchase':pred,
    'User_id' : df_test['User_ID'],
    'Product_ID' : df_test['Product_ID']
})

In [30]:
submit.to_csv('submission.csv', index = False)

PermissionError: [Errno 13] Permission denied: 'submission.csv'

In [ ]:
submit.describe()